//=============================================================================
//
// シーンマネージャー [SceneManager.cpp]
// Author : 川井一生
//
//=============================================================================
// インクルードファイル
#include "SceneManager.h"

//=============================================================================
// 初期化処理
void SceneManager::Init(Scene *pgs)
{
	m_Scene = pgs;

	m_Scene->Init();
}

//=============================================================================
// 最新処理
void SceneManager::Update()
{
	Scene* Next = m_Scene->Update();
	if (Next == m_Scene)
	{
		return;
	}
	else
	{
		Uninit();
		m_Scene = Next;
		m_Scene->Init();
	}
}

//=============================================================================
// 描画処理
void SceneManager::Draw()
{
	m_Scene->Draw();
}

//=============================================================================
// 終了処理
void SceneManager::Uninit()
{
	m_Scene->Uninit();
	delete m_Scene;
}
