//=============================================================================
//
// シーンマネージャ [SceneManager.h]
// Author : 川井一生
//
//=============================================================================
#ifndef _SCENE_MANAGER_H_
#define _SCENE_MANAGER_H_
//=============================================================================
// インクルードファイル
#include "Scene.h"

//=============================================================================
// クラス宣言
class SceneManager
{
public:

	Scene *m_Scene;

	void Init(Scene *pgs);
	void Update();
	void Draw();
	void Uninit();

};
#endif